reports/kunlun_p800/benchmark/MiniMax-M2.5-W8A8-INT8-Dynamic/test_01/01/64-320-i10240-o256/bench-64-320-i10240-o256.log
/root/miniconda/envs/python310_torch25_cuda/lib/python3.10/site-packages/xpytorch_import_hook.py:6: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  import pkg_resources
XCCL /root/miniconda/envs/python310_torch25_cuda/lib/python3.10/site-packages/torch_xmlir/libbkcl.so loaded
SYMBOL_REWRITE torch success
INFO 03-24 22:51:28 [__init__.py:36] Available plugins for group vllm.platform_plugins:
INFO 03-24 22:51:28 [__init__.py:38] - kunlun -> vllm_kunlun:register
INFO 03-24 22:51:28 [__init__.py:41] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 03-24 22:51:28 [__init__.py:36] Available plugins for group vllm.platform_plugins:
INFO 03-24 22:51:28 [__init__.py:38] - kunlun -> vllm_kunlun:register
INFO 03-24 22:51:28 [__init__.py:41] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 03-24 22:51:28 [__init__.py:220] No platform detected, vLLM is running on UnspecifiedPlatform
INFO 03-24 22:51:31 [__init__.py:207] Platform plugin kunlun is activated
WARNING 03-24 22:51:32 [_custom_ops.py:20] Failed to import from vllm._C with ImportError('libcudart.so.12: cannot open shared object file: No such file or directory')
[Monkey Patch Applied] >>> from vllm.model_executor.layers.fused_moe.layer.UnquantizedFusedMoEMethod       --> vllm_kunlun.ops.fused_moe.layer.KunlunUnquantizedFusedMoEMethod
[Monkey Patch Applied] >>> from vllm.model_executor.layers.fused_moe.layer.FusedMoE       --> vllm_kunlun.ops.fused_moe.layer.KunlunFusedMoE
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.awq.AWQLinearMethod       --> vllm_kunlun.ops.quantization.awq.KunlunAWQLinearMethod
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.awq.AWQConfig       --> vllm_kunlun.ops.quantization.awq.KunlunAWQConfig
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.compressed_tensors.compressed_tensors.CompressedTensorsConfig       --> vllm_kunlun.ops.quantization.compressed_tensors.KunlunCompressedTensorsConfig
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.gptq.GPTQLinearMethod       --> vllm_kunlun.ops.quantization.gptq.KunlunGPTQLinearMethod
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.moe_wna16.MoeWNA16Method       --> vllm_kunlun.ops.quantization.moe_wna16.KunlunMoeWNA16Method
ERROR 03-24 22:51:34 [fa_utils.py:57] Cannot use FA version 2 is not supported due to FA2 is unavaible due to: libcudart.so.12: cannot open shared object file: No such file or directory
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_vl:Qwen2VLForConditionalGeneration.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_5_vl:Qwen2_5_VLForConditionalGeneration.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3:Qwen3ForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_moe:Qwen3MoeForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3NextForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_next:Qwen3NextForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3NextMTP is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_next_mtp:Qwen3NextMTP.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture GlmForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.glm:GlmForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture InternLM2ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.internlm2:InternLM2ForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture InternVLChatModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.internvl:InternVLChatModel.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture InternS1ForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.interns1:InternS1ForConditionalGeneration.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_vl:Qwen3VLForConditionalGeneration.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture Qwen3VLMoeForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_vl_moe:Qwen3VLMoeForConditionalGeneration.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture SeedOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.seed_oss:SeedOssForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture DeepseekV32ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 03-24 22:51:34 [registry.py:582] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_mtp:DeepSeekMTP.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fd537ca16c0>, seed=123, num_prompts=320, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10240, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', endpoint_type=None, base_url='http://127.0.0.1:8092', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='/data/MiniMax-M2.5-W8A8-INT8-Dynamic', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=0.7, tokenizer_mode='auto', served_model_name='MiniMax2.5', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30)
INFO 03-24 22:51:35 [datasets.py:507] Sampling input_len from [10240, 10240] and output_len from [256, 256]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:06 elapsed, 68:34:15 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/320 [00:00<?, ?it/s]
  0%|          | 1/320 [00:11<1:01:52, 11.64s/it]
  1%|          | 2/320 [00:14<33:38,  6.35s/it]  
  1%|          | 3/320 [00:16<23:47,  4.50s/it]
  1%|▏         | 4/320 [00:17<16:37,  3.16s/it]
  2%|▏         | 5/320 [00:18<11:58,  2.28s/it]
  2%|▏         | 6/320 [00:19<09:10,  1.75s/it]
  2%|▏         | 7/320 [00:19<07:24,  1.42s/it]
  2%|▎         | 8/320 [00:20<06:13,  1.20s/it]
  3%|▎         | 9/320 [00:21<05:08,  1.01it/s]
  3%|▎         | 10/320 [00:22<04:59,  1.04it/s]
  3%|▎         | 11/320 [00:26<10:52,  2.11s/it]
  4%|▍         | 12/320 [00:28<10:26,  2.03s/it]
  4%|▍         | 13/320 [00:29<09:15,  1.81s/it]
  4%|▍         | 14/320 [00:30<07:42,  1.51s/it]
  5%|▍         | 15/320 [00:33<08:55,  1.76s/it]
  5%|▌         | 16/320 [00:34<07:58,  1.57s/it]
  5%|▌         | 17/320 [00:34<06:40,  1.32s/it]
  6%|▌         | 18/320 [00:35<05:45,  1.14s/it]
  6%|▌         | 19/320 [00:36<05:09,  1.03s/it]
  6%|▋         | 20/320 [00:37<04:44,  1.05it/s]
  7%|▋         | 21/320 [00:41<10:20,  2.07s/it]
  7%|▋         | 22/320 [00:43<09:19,  1.88s/it]
  7%|▋         | 23/320 [00:44<08:43,  1.76s/it]
  8%|▊         | 24/320 [00:45<07:38,  1.55s/it]
  8%|▊         | 25/320 [00:48<08:45,  1.78s/it]
  8%|▊         | 26/320 [00:49<07:48,  1.59s/it]
  8%|▊         | 27/320 [00:50<06:31,  1.34s/it]
  9%|▉         | 28/320 [00:50<05:37,  1.15s/it]
  9%|▉         | 29/320 [00:51<05:01,  1.04s/it]
  9%|▉         | 30/320 [00:52<04:36,  1.05it/s]
 10%|▉         | 31/320 [00:56<09:56,  2.06s/it]
 10%|█         | 32/320 [00:58<08:58,  1.87s/it]
 10%|█         | 33/320 [00:59<07:40,  1.61s/it]
 11%|█         | 34/320 [01:00<07:00,  1.47s/it]
 11%|█         | 35/320 [01:01<06:23,  1.35s/it]
 11%|█▏        | 36/320 [01:03<07:44,  1.64s/it]
 12%|█▏        | 37/320 [01:05<07:02,  1.49s/it]
 12%|█▏        | 38/320 [01:05<06:02,  1.29s/it]
 12%|█▏        | 39/320 [01:06<05:17,  1.13s/it]
 12%|█▎        | 40/320 [01:07<04:45,  1.02s/it]
 13%|█▎        | 41/320 [01:12<09:50,  2.12s/it]
 13%|█▎        | 43/320 [01:14<07:27,  1.62s/it]
 14%|█▍        | 44/320 [01:15<06:43,  1.46s/it]
 14%|█▍        | 45/320 [01:16<06:19,  1.38s/it]
 14%|█▍        | 46/320 [01:18<07:56,  1.74s/it]
 15%|█▍        | 47/320 [01:20<07:09,  1.57s/it]
 15%|█▌        | 48/320 [01:20<06:07,  1.35s/it]
 15%|█▌        | 49/320 [01:21<05:19,  1.18s/it]
 16%|█▌        | 50/320 [01:22<04:45,  1.06s/it]
 16%|█▌        | 51/320 [01:26<09:17,  2.07s/it]
 16%|█▋        | 52/320 [01:27<07:38,  1.71s/it]
 17%|█▋        | 53/320 [01:29<07:11,  1.62s/it]
 17%|█▋        | 54/320 [01:30<06:20,  1.43s/it]
 17%|█▋        | 55/320 [01:31<05:57,  1.35s/it]
 18%|█▊        | 56/320 [01:32<05:33,  1.26s/it]
 18%|█▊        | 57/320 [01:34<06:23,  1.46s/it]
 18%|█▊        | 58/320 [01:35<05:50,  1.34s/it]
 18%|█▊        | 59/320 [01:36<05:35,  1.29s/it]
 19%|█▉        | 60/320 [01:37<05:04,  1.17s/it]
 19%|█▉        | 61/320 [01:42<09:30,  2.20s/it]
 19%|█▉        | 62/320 [01:42<07:44,  1.80s/it]
 20%|█▉        | 63/320 [01:43<06:29,  1.52s/it]
 20%|██        | 64/320 [01:45<06:28,  1.52s/it]
 20%|██        | 65/320 [01:46<05:59,  1.41s/it]
 21%|██        | 66/320 [01:47<05:11,  1.23s/it]
 21%|██        | 67/320 [01:49<06:21,  1.51s/it]
 21%|██▏       | 68/320 [01:50<05:45,  1.37s/it]
 22%|██▏       | 69/320 [01:51<05:27,  1.31s/it]
 22%|██▏       | 70/320 [01:52<04:54,  1.18s/it]
 22%|██▏       | 71/320 [01:56<08:51,  2.13s/it]
 22%|██▎       | 72/320 [01:57<07:19,  1.77s/it]
 23%|██▎       | 73/320 [01:58<06:10,  1.50s/it]
 23%|██▎       | 74/320 [01:59<05:21,  1.31s/it]
 23%|██▎       | 75/320 [02:01<05:36,  1.37s/it]
 24%|██▍       | 76/320 [02:02<05:18,  1.31s/it]
 24%|██▍       | 77/320 [02:04<06:29,  1.60s/it]
 24%|██▍       | 78/320 [02:05<05:48,  1.44s/it]
 25%|██▍       | 79/320 [02:06<04:55,  1.23s/it]
 25%|██▌       | 80/320 [02:07<04:44,  1.19s/it]
 25%|██▌       | 81/320 [02:10<07:17,  1.83s/it]
 26%|██▌       | 82/320 [02:12<07:21,  1.86s/it]
 26%|██▌       | 83/320 [02:13<06:28,  1.64s/it]
 26%|██▋       | 84/320 [02:14<05:31,  1.40s/it]
 27%|██▋       | 85/320 [02:16<05:37,  1.44s/it]
 27%|██▋       | 86/320 [02:17<05:16,  1.35s/it]
 27%|██▋       | 87/320 [02:19<06:21,  1.64s/it]
 28%|██▊       | 88/320 [02:20<05:39,  1.46s/it]
 28%|██▊       | 89/320 [02:21<04:47,  1.25s/it]
 28%|██▊       | 90/320 [02:22<04:35,  1.20s/it]
 28%|██▊       | 91/320 [02:25<07:01,  1.84s/it]
 29%|██▉       | 92/320 [02:27<07:04,  1.86s/it]
 29%|██▉       | 93/320 [02:28<05:54,  1.56s/it]
 29%|██▉       | 94/320 [02:29<05:09,  1.37s/it]
 30%|██▉       | 95/320 [02:30<04:33,  1.22s/it]
 30%|███       | 96/320 [02:31<04:52,  1.31s/it]
 30%|███       | 97/320 [02:33<04:41,  1.26s/it]
 31%|███       | 98/320 [02:34<04:39,  1.26s/it]
 31%|███       | 99/320 [02:35<05:09,  1.40s/it]
 31%|███▏      | 100/320 [02:37<05:17,  1.44s/it]
 32%|███▏      | 101/320 [02:40<07:20,  2.01s/it]
 32%|███▏      | 102/320 [02:42<07:11,  1.98s/it]
 32%|███▏      | 103/320 [02:43<05:56,  1.65s/it]
 32%|███▎      | 104/320 [02:44<05:08,  1.43s/it]
 33%|███▎      | 105/320 [02:45<04:30,  1.26s/it]
 33%|███▎      | 106/320 [02:46<04:37,  1.30s/it]
 33%|███▎      | 107/320 [02:47<04:04,  1.15s/it]
 34%|███▍      | 108/320 [02:49<04:40,  1.33s/it]
 34%|███▍      | 109/320 [02:50<04:24,  1.25s/it]
 34%|███▍      | 110/320 [02:51<04:24,  1.26s/it]
 35%|███▍      | 111/320 [02:55<07:27,  2.14s/it]
 35%|███▌      | 113/320 [02:57<05:14,  1.52s/it]
 36%|███▌      | 114/320 [02:59<05:19,  1.55s/it]
 36%|███▌      | 115/320 [03:00<04:54,  1.44s/it]
 36%|███▋      | 116/320 [03:01<04:21,  1.28s/it]
 37%|███▋      | 117/320 [03:02<04:33,  1.35s/it]
 37%|███▋      | 118/320 [03:04<04:33,  1.35s/it]
 37%|███▋      | 119/320 [03:05<04:19,  1.29s/it]
 38%|███▊      | 120/320 [03:06<04:42,  1.41s/it]
 38%|███▊      | 121/320 [03:09<05:58,  1.80s/it]
 38%|███▊      | 122/320 [03:11<06:16,  1.90s/it]
 38%|███▊      | 123/320 [03:12<05:15,  1.60s/it]
 39%|███▉      | 124/320 [03:14<05:16,  1.61s/it]
 39%|███▉      | 125/320 [03:15<04:46,  1.47s/it]
 39%|███▉      | 126/320 [03:16<04:09,  1.29s/it]
 40%|███▉      | 127/320 [03:17<04:21,  1.36s/it]
 40%|████      | 128/320 [03:19<04:19,  1.35s/it]
 40%|████      | 129/320 [03:20<04:01,  1.26s/it]
 41%|████      | 130/320 [03:21<04:26,  1.40s/it]
 41%|████      | 131/320 [03:24<05:42,  1.81s/it]
 41%|████▏     | 132/320 [03:26<06:00,  1.92s/it]
 42%|████▏     | 133/320 [03:27<05:00,  1.61s/it]
 42%|████▏     | 134/320 [03:29<05:01,  1.62s/it]
 42%|████▏     | 135/320 [03:30<04:32,  1.47s/it]
 42%|████▎     | 136/320 [03:31<03:56,  1.29s/it]
 43%|████▎     | 137/320 [03:32<03:26,  1.13s/it]
 43%|████▎     | 138/320 [03:33<03:41,  1.21s/it]
 43%|████▎     | 139/320 [03:34<03:47,  1.26s/it]
 44%|████▍     | 140/320 [03:36<04:32,  1.51s/it]
 44%|████▍     | 141/320 [03:39<05:39,  1.89s/it]
 44%|████▍     | 142/320 [03:41<05:50,  1.97s/it]
 45%|████▍     | 143/320 [03:42<04:51,  1.65s/it]
 45%|████▌     | 144/320 [03:44<04:49,  1.65s/it]
 45%|████▌     | 145/320 [03:45<04:20,  1.49s/it]
 46%|████▌     | 146/320 [03:46<03:46,  1.30s/it]
 46%|████▌     | 147/320 [03:47<03:16,  1.14s/it]
 46%|████▋     | 148/320 [03:48<03:30,  1.22s/it]
 47%|████▋     | 149/320 [03:49<03:35,  1.26s/it]
 47%|████▋     | 150/320 [03:52<04:17,  1.51s/it]
 47%|████▋     | 151/320 [03:54<05:18,  1.89s/it]
 48%|████▊     | 152/320 [03:56<05:29,  1.96s/it]
 48%|████▊     | 153/320 [03:57<04:34,  1.64s/it]
 48%|████▊     | 154/320 [03:59<04:08,  1.50s/it]
 48%|████▊     | 155/320 [04:00<03:50,  1.39s/it]
 49%|████▉     | 156/320 [04:01<03:35,  1.31s/it]
 49%|████▉     | 157/320 [04:02<03:11,  1.18s/it]
 49%|████▉     | 158/320 [04:03<03:27,  1.28s/it]
 50%|████▉     | 159/320 [04:04<03:18,  1.23s/it]
 50%|█████     | 160/320 [04:05<03:00,  1.13s/it]
 50%|█████     | 161/320 [04:07<03:46,  1.43s/it]
 51%|█████     | 162/320 [04:09<04:21,  1.65s/it]
 51%|█████     | 163/320 [04:12<05:10,  1.98s/it]
 51%|█████▏    | 164/320 [04:13<04:17,  1.65s/it]
 52%|█████▏    | 165/320 [04:14<03:53,  1.51s/it]
 52%|█████▏    | 166/320 [04:16<03:57,  1.54s/it]
 52%|█████▏    | 167/320 [04:17<03:24,  1.33s/it]
 52%|█████▎    | 168/320 [04:18<03:30,  1.39s/it]
 53%|█████▎    | 169/320 [04:19<03:17,  1.31s/it]
 53%|█████▎    | 171/320 [04:22<03:27,  1.39s/it]
 54%|█████▍    | 172/320 [04:25<03:55,  1.59s/it]
 54%|█████▍    | 173/320 [04:27<04:37,  1.89s/it]
 54%|█████▍    | 174/320 [04:28<03:56,  1.62s/it]
 55%|█████▍    | 175/320 [04:29<03:35,  1.49s/it]
 55%|█████▌    | 176/320 [04:31<03:39,  1.52s/it]
 55%|█████▌    | 177/320 [04:32<03:10,  1.33s/it]
 56%|█████▌    | 178/320 [04:33<03:16,  1.39s/it]
 56%|█████▌    | 179/320 [04:34<03:04,  1.31s/it]
 56%|█████▋    | 180/320 [04:35<02:31,  1.08s/it]
 57%|█████▋    | 181/320 [04:37<03:26,  1.49s/it]
 57%|█████▋    | 182/320 [04:40<03:53,  1.69s/it]
 57%|█████▋    | 183/320 [04:42<04:34,  2.00s/it]
 57%|█████▊    | 184/320 [04:43<03:47,  1.67s/it]
 58%|█████▊    | 185/320 [04:44<03:24,  1.52s/it]
 58%|█████▊    | 186/320 [04:46<03:27,  1.55s/it]
 58%|█████▊    | 187/320 [04:47<02:58,  1.34s/it]
 59%|█████▉    | 188/320 [04:48<03:04,  1.39s/it]
 59%|█████▉    | 189/320 [04:50<02:52,  1.32s/it]
 59%|█████▉    | 190/320 [04:50<02:20,  1.08s/it]
 60%|█████▉    | 191/320 [04:52<03:11,  1.49s/it]
 60%|██████    | 192/320 [04:53<02:46,  1.30s/it]
 60%|██████    | 193/320 [04:55<03:02,  1.43s/it]
 61%|██████    | 194/320 [04:56<02:45,  1.31s/it]
 61%|██████    | 195/320 [04:59<03:32,  1.70s/it]
 61%|██████▏   | 196/320 [05:01<03:54,  1.89s/it]
 62%|██████▏   | 197/320 [05:02<03:14,  1.58s/it]
 62%|██████▏   | 198/320 [05:03<03:10,  1.56s/it]
 62%|██████▏   | 199/320 [05:05<02:53,  1.43s/it]
 62%|██████▎   | 200/320 [05:05<02:19,  1.16s/it]
 63%|██████▎   | 201/320 [05:07<02:30,  1.26s/it]
 63%|██████▎   | 202/320 [05:07<02:16,  1.15s/it]
 63%|██████▎   | 203/320 [05:09<02:23,  1.22s/it]
 64%|██████▍   | 204/320 [05:11<02:43,  1.41s/it]
 64%|██████▍   | 205/320 [05:12<02:31,  1.32s/it]
 64%|██████▍   | 206/320 [05:14<02:53,  1.53s/it]
 65%|██████▍   | 207/320 [05:17<03:40,  1.95s/it]
 65%|██████▌   | 208/320 [05:18<03:01,  1.62s/it]
 65%|██████▌   | 209/320 [05:20<03:11,  1.73s/it]
 66%|██████▌   | 211/320 [05:20<01:55,  1.06s/it]
 66%|██████▋   | 212/320 [05:22<02:22,  1.32s/it]
 67%|██████▋   | 213/320 [05:24<02:29,  1.40s/it]
 67%|██████▋   | 214/320 [05:26<02:41,  1.52s/it]
 67%|██████▋   | 215/320 [05:27<02:27,  1.41s/it]
 68%|██████▊   | 216/320 [05:29<02:44,  1.58s/it]
 68%|██████▊   | 217/320 [05:32<03:23,  1.98s/it]
 68%|██████▊   | 218/320 [05:33<02:48,  1.65s/it]
 68%|██████▊   | 219/320 [05:35<02:56,  1.75s/it]
 69%|██████▉   | 220/320 [05:35<02:19,  1.39s/it]
 69%|██████▉   | 221/320 [05:36<01:52,  1.14s/it]
 69%|██████▉   | 222/320 [05:37<02:04,  1.27s/it]
 70%|██████▉   | 223/320 [05:39<02:13,  1.37s/it]
 70%|███████   | 224/320 [05:41<02:25,  1.51s/it]
 70%|███████   | 225/320 [05:42<02:12,  1.40s/it]
 71%|███████   | 226/320 [05:44<02:28,  1.58s/it]
 71%|███████   | 227/320 [05:46<02:42,  1.75s/it]
 71%|███████▏  | 228/320 [05:48<02:33,  1.66s/it]
 72%|███████▏  | 229/320 [05:50<02:45,  1.82s/it]
 72%|███████▏  | 230/320 [05:50<02:09,  1.44s/it]
 72%|███████▏  | 231/320 [05:51<01:44,  1.17s/it]
 72%|███████▎  | 232/320 [05:52<01:53,  1.29s/it]
 73%|███████▎  | 233/320 [05:54<02:00,  1.39s/it]
 73%|███████▎  | 234/320 [05:55<01:58,  1.38s/it]
 73%|███████▎  | 235/320 [05:57<01:51,  1.31s/it]
 74%|███████▍  | 236/320 [05:58<01:45,  1.25s/it]
 74%|███████▍  | 237/320 [06:01<02:39,  1.92s/it]
 74%|███████▍  | 238/320 [06:03<02:26,  1.78s/it]
 75%|███████▍  | 239/320 [06:04<02:03,  1.53s/it]
 75%|███████▌  | 240/320 [06:05<02:11,  1.64s/it]
 75%|███████▌  | 241/320 [06:06<01:43,  1.31s/it]
 76%|███████▌  | 242/320 [06:07<01:46,  1.36s/it]
 76%|███████▌  | 243/320 [06:09<01:50,  1.44s/it]
 76%|███████▋  | 244/320 [06:10<01:47,  1.41s/it]
 77%|███████▋  | 245/320 [06:12<01:40,  1.34s/it]
 77%|███████▋  | 246/320 [06:13<01:34,  1.27s/it]
 77%|███████▋  | 247/320 [06:16<02:21,  1.94s/it]
 78%|███████▊  | 248/320 [06:18<02:09,  1.80s/it]
 78%|███████▊  | 249/320 [06:19<01:48,  1.53s/it]
 78%|███████▊  | 250/320 [06:20<01:49,  1.57s/it]
 78%|███████▊  | 251/320 [06:21<01:35,  1.38s/it]
 79%|███████▉  | 252/320 [06:23<01:33,  1.38s/it]
 79%|███████▉  | 253/320 [06:24<01:37,  1.45s/it]
 79%|███████▉  | 254/320 [06:26<01:33,  1.42s/it]
 80%|███████▉  | 255/320 [06:27<01:27,  1.34s/it]
 80%|████████  | 256/320 [06:28<01:21,  1.28s/it]
 80%|████████  | 257/320 [06:31<02:02,  1.94s/it]
 81%|████████  | 258/320 [06:33<01:51,  1.79s/it]
 81%|████████  | 259/320 [06:34<01:33,  1.53s/it]
 81%|████████▏ | 260/320 [06:35<01:34,  1.57s/it]
 82%|████████▏ | 261/320 [06:36<01:21,  1.37s/it]
 82%|████████▏ | 262/320 [06:38<01:19,  1.38s/it]
 82%|████████▏ | 263/320 [06:39<01:22,  1.45s/it]
 82%|████████▎ | 264/320 [06:40<01:10,  1.25s/it]
 83%|████████▎ | 265/320 [06:42<01:16,  1.39s/it]
 83%|████████▎ | 266/320 [06:43<01:10,  1.31s/it]
 83%|████████▎ | 267/320 [06:46<01:44,  1.97s/it]
 84%|████████▍ | 268/320 [06:48<01:34,  1.81s/it]
 84%|████████▍ | 269/320 [06:49<01:18,  1.55s/it]
 84%|████████▍ | 270/320 [06:50<01:18,  1.58s/it]
 85%|████████▍ | 271/320 [06:51<01:07,  1.38s/it]
 85%|████████▌ | 272/320 [06:53<01:06,  1.38s/it]
 85%|████████▌ | 273/320 [06:54<01:08,  1.45s/it]
 86%|████████▌ | 274/320 [06:55<00:56,  1.23s/it]
 86%|████████▌ | 275/320 [06:56<00:48,  1.08s/it]
 86%|████████▋ | 276/320 [06:57<00:55,  1.27s/it]
 87%|████████▋ | 277/320 [06:59<00:52,  1.23s/it]
 87%|████████▋ | 278/320 [07:01<01:10,  1.69s/it]
 87%|████████▋ | 279/320 [07:04<01:15,  1.84s/it]
 88%|████████▊ | 280/320 [07:05<01:14,  1.86s/it]
 88%|████████▊ | 281/320 [07:06<01:01,  1.58s/it]
 88%|████████▊ | 282/320 [07:08<00:57,  1.53s/it]
 88%|████████▊ | 283/320 [07:09<00:57,  1.55s/it]
 89%|████████▉ | 284/320 [07:10<00:46,  1.30s/it]
 89%|████████▉ | 285/320 [07:11<00:39,  1.13s/it]
 89%|████████▉ | 286/320 [07:13<00:44,  1.31s/it]
 90%|████████▉ | 287/320 [07:14<00:41,  1.25s/it]
 90%|█████████ | 288/320 [07:16<00:54,  1.70s/it]
 90%|█████████ | 289/320 [07:19<00:57,  1.84s/it]
 91%|█████████ | 290/320 [07:21<00:55,  1.86s/it]
 91%|█████████ | 291/320 [07:21<00:45,  1.58s/it]
 91%|█████████▏| 292/320 [07:23<00:42,  1.52s/it]
 92%|█████████▏| 293/320 [07:24<00:41,  1.55s/it]
 92%|█████████▏| 294/320 [07:25<00:33,  1.30s/it]
 92%|█████████▏| 295/320 [07:26<00:28,  1.13s/it]
 92%|█████████▎| 296/320 [07:28<00:31,  1.30s/it]
 93%|█████████▎| 297/320 [07:29<00:28,  1.25s/it]
 93%|█████████▎| 298/320 [07:32<00:37,  1.70s/it]
 93%|█████████▎| 299/320 [07:34<00:38,  1.85s/it]
 94%|█████████▍| 300/320 [07:36<00:37,  1.86s/it]
 94%|█████████▍| 301/320 [07:37<00:30,  1.58s/it]
 94%|█████████▍| 302/320 [07:38<00:27,  1.52s/it]
 95%|█████████▍| 303/320 [07:39<00:24,  1.42s/it]
 95%|█████████▌| 304/320 [07:40<00:21,  1.32s/it]
 95%|█████████▌| 305/320 [07:41<00:17,  1.15s/it]
 96%|█████████▌| 306/320 [07:42<00:14,  1.02s/it]
 96%|█████████▌| 307/320 [07:44<00:17,  1.36s/it]
 96%|█████████▋| 308/320 [07:45<00:17,  1.43s/it]
 97%|█████████▋| 309/320 [07:49<00:22,  2.00s/it]
 97%|█████████▋| 310/320 [07:50<00:17,  1.76s/it]
 97%|█████████▋| 311/320 [07:51<00:13,  1.51s/it]
 98%|█████████▊| 312/320 [07:51<00:09,  1.19s/it]
 98%|█████████▊| 313/320 [07:53<00:08,  1.24s/it]
 98%|█████████▊| 314/320 [07:53<00:05,  1.02it/s]
 99%|█████████▉| 316/320 [07:53<00:02,  1.80it/s]
 99%|█████████▉| 317/320 [07:54<00:02,  1.46it/s]
 99%|█████████▉| 318/320 [07:55<00:01,  1.48it/s]
100%|█████████▉| 319/320 [07:57<00:00,  1.02it/s]
100%|██████████| 320/320 [07:57<00:00,  1.25it/s]
100%|██████████| 320/320 [07:57<00:00,  1.49s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     320       
Maximum request concurrency:             64        
Benchmark duration (s):                  477.53    
Total input tokens:                      3276748   
Total generated tokens:                  79358     
Request throughput (req/s):              0.67      
Output token throughput (tok/s):         166.18    
Peak output token throughput (tok/s):    310.00    
Peak concurrent requests:                67.00     
Total Token throughput (tok/s):          7027.99   
---------------Time to First Token----------------
Mean TTFT (ms):                          73483.64  
Median TTFT (ms):                        80355.19  
P95 TTFT (ms):                           83007.06  
P99 TTFT (ms):                           86884.30  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          56.43     
Median TPOT (ms):                        56.32     
P95 TPOT (ms):                           61.17     
P99 TPOT (ms):                           63.21     
---------------Inter-token Latency----------------
Mean ITL (ms):                           56.24     
Median ITL (ms):                         32.93     
P95 ITL (ms):                            188.83    
P99 ITL (ms):                            540.19    
==================================================